{"intents":[
    {"tag":"greetings",
    "patterns":["hello","hey","hi","good day","greetings","what's up","how is going"],
    "responses":["Hello!","Hey","What can I do for you?"]
    },
    {"tag":"goodbye",
    "patterns":["See you later","bye","goodbye","have a good day"],
    "responses":["Goodbye","Sad to see you go","Bye"]
    },
    {"tag":"name",
    "patterns":["what is your name","what should I call you","whats your name?","who are you?","what shall i call you"],
    "responses":["You can call me Rubie","I'm Rubie","I'm Rubie,your assistant"]
    },
    {"tag":"rubber",
    "patterns":["which sort of rubber can I get?","I want rubber"],
    "responses":["We supply synthetic as well as natural rubber products","We manufacture a huge variety of rubber products","We satisfy needs for a wide variety rubber products"]
    },
    {"tag":"order",
    "patterns":["How can I order?","Can I order online","When will I get my order?","I want rubber"],
    "responses":["You can order online as well as by getting in touch with our representatives","We deliver products within 15 days after the initial payment is made"]
    },
    {"tag":"type",
    "patterns":["Which type of rubber products do you offer?","What type of rubber do you deal with?", "What type of rubber products do you sell?"],
    "responses":["We manufacture the following products : Rubber moulded products , Rubber seals, Rubber Rings , Rubber O-Rings , Rubber caps"]
    },
    {"tag":"Rubber moulded products",
    "patterns":["Which type of rubber moulded products do you offer?","What type of rubber moulded products do you deal with?"],
    "responses":["We manufacture the following products Rubber moulded products: Transformer Rubber washers (Nitrile Rubber), Rubber pistons for PVC pipe industry , Rubber bushes , Rubber couplings , Rubber gaskits"]
    },
    {"tag":"Rubber seals",
    "patterns":["Which type of rubber seals do you offer?","What type of rubber seals do you deal with?" , "What type of rubber seals do you supply?","What are the different rubber seals you manufacture ?"],
    "responses":["We manufacture the following products Rubber Seals: U-Seals , V-shape Rubber Seals "]
    },
    {"tag":"Rubber Rings",
    "patterns":["Which type of Rubber Rings do you offer?","What type of Rubber Rings do you deal with?","What are the different rubber rings you manufacture ?"],
    "responses":["We manufacture the following products Rubber Rings : Slitting line machine rubber spacer , Impact rubber rings "]
    },
    {"tag":"Rubber O-Rings",
    "patterns":["Which type of rubber O Rings do you offer?","What type of rubber O Rings do you deal with?","What are the different rubber O rings you manufacture ?"],
    "responses":["We manufacture the following products Rubber O-Rings : Rubber O-Rings "]
    },
    {"tag":"Rubber Caps",
    "patterns":["Can you tell me the cost of rubber caps?","Give me the discription of rubber caps"],
    "responses":["We manufacture the following products Rubber Caps : Rubber Caps , The product is sold for 2.5 INR per piece, Standard Design is: Shape->Round Rubber, Size->28 mm, Material->Rubber, Color->Black, Diameter->30 mm, Finishing->Coated leveraging on our skilled and qualified professionals , we are , actively involved in offering a range of rubber caps to our valuable customers"]
    },
    {"tag":"Transformer Rubber Washers",
     "patterns":["Would you help me with the rate of Transformer Rubber Washers and its standard description?", "What's the price of transformer nitrile rubber?"],
     "responses":["The product is sold for 2.5 INR per piece, Standard Design is: Shape->Round Rubber, Type->Nitrile, Size->28 mm, Material->Rubber, Color->Black, Diameter->30 mm, Finishing->Coated"]
    },
    {"tag":"Rubber Pistons",
     "patterns":["Would you help me with the rate of Rubber Pistons and its standard description?", "What's the price of Rubber Pistons?"],
     "responses":["The product is sold for 13 INR per piece, Standard Design is: Shape->Round, Material->Rubber, Outer Diameter->63mm, Color->Black, Temperature-.Max. 180 Degree F. We are one of the prominent and leading manufacturers and suppliers of a wide array of Rubber Piston. All our products are manufactured with the aid of our modern infrastructure facility, which ensure safety and hygiene of the products. Under the able guidance of our professionals, we develop these products utilizing maximum amount of resources without any harm to the environment. While manufacturing, we follow industry set norms and guidelines.\n Size : 63mm, 75mm, 90mm, 110mm, 140mm, 160mm, 180mm, 200mm, 225mm etc. \n Features:High performance, Smooth running, Easy operation, Least maintenance, Rugged design"]
    },
    {"tag":"Rubber Bushes",
     "patterns":["Would you help me with the rate of Rubber Bushes and its standard description?", "What's the price of Rubber Bushes?"],
     "responses":["The product is sold for 10 INR per piece, Standard Design is: Shape->Round, Material->Rubber, Outer Diameter->8-12cm, Color->Black, Packaging Type->Box. We are leading manufacture of vast range of Rubber Bushes. We provide it in various shapes, designs and sizes. The elastic properties arise from the its ability to stretch the chain in various applications differently."]
    },
    {
    "tag":"Rubber Couplings",
     "patterns":["Would you help me with the rate of Rubber Couplings and its standard description?", "What's the price of Rubber Couplings?"],
     "responses":["The product is sold for 100 INR per piece, Standard Design is: Shape->Round, Material->Rubber, Application->Two Wheeler Vehicles, Color->Black. We hold maximum expertise and experience in manufacturing and supplying a vast range of the Rubber Coupling. Our extensive ranges of the products are produced by using supreme quality raw materials and other components."]
    },{
    "tag":"Rubber Gaskets",
     "patterns":["Would you help me with the rate of Rubber Gaskets and its standard description?", "What's the price of Rubber Gaskets?"],
     "responses":["The product is sold for 5 INR per piece, Standard Design is: Shape->Ring gasket, Material->Natural Rubber, Finish->Coated, Color->Black. We have achieved a great deal of expertise in both manufacturing and supplying of the most durable Rubber Gaskets available in the industry. Our Rubber Gaskets are dimensionally accurate and the overall designing of its external and internal features are at par with the latest industrial standards. Our Rubber Gaskets are designed to perfection and are made available at competitive rates which are highly beneficial for our clients."]
    },
    {
    "tag":"U-seals",
     "patterns":["Would you help me with the rate of U-seals and its standard description?", "What's the price of U-seals?"],
     "responses":["The product is sold for 17 INR per piece, Standard Design is: Shape->U-shaped, Material->Natural Rubber, Finish->Coated, Color->Black. We have achieved a great deal of expertise in both manufacturing and supplying of the most durable Rubber Gaskets available in the industry. Our U-seals are dimensionally accurate and the overall designing of its external and internal features are at par with the latest industrial standards. Our U-seals are designed to perfection and are made available at competitive rates which are highly beneficial for our clients."]
    },
    {
    "tag":"V-shape rubber seals",
     "patterns":["Would you help me with the rate of V-shape rubber seals and its standard description?", "What's the price of V-shape rubber seals?"],
     "responses":["The product is sold for 50 INR per piece, Standard Design is: Shape->V-shaped, Material->Rubber, Application->Two Wheeler Vehicles, Color->Black. We hold maximum expertise and experience in manufacturing and supplying a vast range of the Rubber Coupling. Our extensive ranges of the products are produced by using supreme quality raw materials and other components."]
    }
    
                            
]}
